class/twoBlockVenturi/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0) //0
    (6 0 0) //1
    (20 0 0) //2
    (0 8 0) //3
    (6 1 0) //4
    (20 4 0) //5
    (0 0 0.1) //6
    (6 0 0.1) //7
    (20 0 0.1) //8
    (0 8 0.1) //9
    (6 1 0.1)//10
    (20 4 0.1)//11
);

blocks
(
    hex (0 1 4 3 6 7 10 9) (40 40 1) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (1 2 5 4 7 8 11 10) (40 40 1) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
);

edges
(
  spline 3 4
  (
    (2 7.3 0)
    (5 1.5 0)
    (5.8 1 0)
    
  )
  spline 9 10
  (
    (2 7.3 0.1)
    (5 1.5 0.1)
    (5.8 1 0.1)
  )
  
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 9 6)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (3 4 10 9)
            (4 5 11 10)
        );
    }
    centerline
    {
      type symmetry;
      faces
      (
	(0 1 7 6)
	(1 2 8 7)
      );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 2 8 11)
        );
    }
    sides
    {
	type empty;
	faces
	(
	  (0 1 4 3)
	  (1 2 5 4)
	  (7 8 11 10)
	  (6 7 10 9)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
